lessons/OrganicChemistry/02.org
#+TITLE: Organic Chemistry 02
#+AUTHOR: MKQ
#+KEYWORDS: note
#+LATEX_COMPILER: xelatex
#+LATEX_HEADER:\usepackage[scheme=plain]{ctex}
* 烷烃的结构
** 碳的四面体构型
- 构造:平面的
- 构型:空间的
** 杂化
sp^3 杂化轨道,s轨道和p轨道进行杂化,
波相相同的一边波瓣变大,不同的一边缩小
** 烷烃分子的表示方法
- 伞形式
- 锯架式
- 纽曼式
** 乙烷的构象
- 构象:三维的
随着乙烷单键的旋转,产生了无数构象
*** 极端构象
- 交叉式
- 重叠式
氢的范德华半径是120,但交叉式中氢氢间距为250,重叠式为229
交叉式是最稳定的,优势构象,内能最低的构象
环烷烃可以把构象冻结起来,单键的自由旋转并非完全自由,交叉式重叠式的比例大概是160:1
*** 丙烷的构象
把一个氢换成甲基,甲基的范德华半径是200
*** 正丁烷的构象
然后就有了甲基和甲基重叠的情况
- 构象分布:各种构象的比例
*** 乙烷衍生物
还有分子内的氢键的作用
* 烷烃的物理性质
** 状态
- 1-4个碳:气体
- qwq
** 熔点
和分子质量,分子间作用力,晶格堆积的密集程度有关,偶数碳烷烃沸点增长要多一些
** 密度
大多数有机物沸点比水小,但是有卤素可能会改变,比如四氯化碳
** 化学性质
非常稳定不容易发生反应,所以可以拿来作为溶剂
** 反应
*** 卤代反应
甲烷的卤代
** 反应机理
卤代反应:经历了自由基中间体
Cl-Cl比C-C和C-H更容易断裂,这主要是键能的差别
- 氧气:自由基抑制剂,常用的有,对苯二酚,硝基甲烷,但氧气还可以作为自由基引发剂
*** 自由基稳定性
自由基中心碳是sp^2 杂化的,是个平面结构,有个p轨道垂直于平面
C外层是个缺电子的结构,其他甲基可以给它一个给电子共轭
当然还有位阻之类的原因
- 超共轭效应
- 诱导效应
认为氢不给电子也不吸电子,
给电子:正共轭/诱导,吸电子:负共轭/诱导
** 过渡态,中间体,活化能,反应热
- 过渡态:波峰
- 中间体:波谷
- 活化能:底物到过渡态的能垒
*** Hammond假说
过渡态的样子和能量接近的一方相近
- 所以说溴代反应比氯代反应选择性更高



