lessons/OrganicChemistry/02.tex
% Created 2019-09-10 二 11:44
% Intended LaTeX compiler: xelatex
\documentclass[11pt]{article}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[scheme=plain]{ctex}
\author{MKQ}
\date{\today}
\title{Organic Chemistry 02}
\hypersetup{
 pdfauthor={MKQ},
 pdftitle={Organic Chemistry 02},
 pdfkeywords={note},
 pdfsubject={},
 pdfcreator={Emacs 24.5.1 (Org mode 9.0.3)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\section{烷烃的结构}
\label{sec:orgd243e42}
\subsection{碳的四面体构型}
\label{sec:org61bdd25}
\begin{itemize}
\item 构造:平面的
\item 构型:空间的
\end{itemize}
\subsection{杂化}
\label{sec:org4743c32}
sp\(^{\text{3}}\) 杂化轨道,s轨道和p轨道进行杂化,
波相相同的一边波瓣变大,不同的一边缩小
\subsection{烷烃分子的表示方法}
\label{sec:org82c5efb}
\begin{itemize}
\item 伞形式
\item 锯架式
\item 纽曼式
\end{itemize}
\subsection{乙烷的构象}
\label{sec:org770680a}
\begin{itemize}
\item 构象:三维的
\end{itemize}
随着乙烷单键的旋转,产生了无数构象
\subsubsection{极端构象}
\label{sec:orge44588f}
\begin{itemize}
\item 交叉式
\item 重叠式
\end{itemize}
氢的范德华半径是120,但交叉式中氢氢间距为250,重叠式为229
交叉式是最稳定的,优势构象,内能最低的构象
环烷烃可以把构象冻结起来,单键的自由旋转并非完全自由,交叉式重叠式的比例大概是160:1
\subsubsection{丙烷的构象}
\label{sec:orge364b25}
把一个氢换成甲基,甲基的范德华半径是200
\subsubsection{正丁烷的构象}
\label{sec:org818feb8}
然后就有了甲基和甲基重叠的情况
\begin{itemize}
\item 构象分布:各种构象的比例
\end{itemize}
\subsubsection{乙烷衍生物}
\label{sec:orgd543f6d}
还有分子内的氢键的作用
\section{烷烃的物理性质}
\label{sec:org6836ce6}
\subsection{状态}
\label{sec:orgd20070f}
\begin{itemize}
\item 1-4个碳:气体
\item qwq
\end{itemize}
\subsection{熔点}
\label{sec:orgb665b4f}
和分子质量,分子间作用力,晶格堆积的密集程度有关,偶数碳烷烃沸点增长要多一些
\subsection{密度}
\label{sec:orgffd545e}
大多数有机物沸点比水小,但是有卤素可能会改变,比如四氯化碳
\subsection{化学性质}
\label{sec:org968d657}
非常稳定不容易发生反应,所以可以拿来作为溶剂
\subsection{反应}
\label{sec:orgead90fb}
\subsubsection{卤代反应}
\label{sec:org242588c}
甲烷的卤代
\subsection{反应机理}
\label{sec:orgebcb299}
卤代反应:经历了自由基中间体
Cl-Cl比C-C和C-H更容易断裂,这主要是键能的差别
\begin{itemize}
\item 氧气:自由基抑制剂,常用的有,对苯二酚,硝基甲烷,但氧气还可以作为自由基引发剂
\end{itemize}
\subsubsection{自由基稳定性}
\label{sec:org6e5454d}
自由基中心碳是sp\(^{\text{2}}\) 杂化的,是个平面结构,有个p轨道垂直于平面
C外层是个缺电子的结构,其他甲基可以给它一个给电子共轭
当然还有位阻之类的原因
\begin{itemize}
\item 超共轭效应
\item 诱导效应
\end{itemize}
认为氢不给电子也不吸电子,
给电子:正共轭/诱导,吸电子:负共轭/诱导
\subsection{过渡态,中间体,活化能,反应热}
\label{sec:orgbeb3373}
\begin{itemize}
\item 过渡态:波峰
\item 中间体:波谷
\item 活化能:底物到过渡态的能垒
\end{itemize}
\subsubsection{Hammond假说}
\label{sec:org7eefd32}
过渡态的样子和能量接近的一方相近
\begin{itemize}
\item 所以说溴代反应比氯代反应选择性更高
\end{itemize}
\end{document}
